<?php

/**
 * +----------------------------------------------------------------------
 * | AdminInterface
 * +----------------------------------------------------------------------
 * | Copyright (c) 2017-2020 https://github.com/littlezo All rights reserved.
 * +----------------------------------------------------------------------
 * | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
 * +----------------------------------------------------------------------
 * | Author: @小小只 <soinco@qq.com>
 * +----------------------------------------------------------------------
 */


/**
 * php think build 自动生成应用的目录结构的定义示例 单应用模式
 */
return [
    '__app__' => [],
    // 需要自动创建的文件
    '__file__'   => [],
    // 需要自动创建的目录
    '__dir__'    => [],
    // 需要自动创建的控制器
    'controller' => [
        'v1/admin/Index',
        'v1/api/Index',
    ],
    // 需要自动创建的模型
    'model'      => [
        'v1/ChatInfo',
    ],
    // 需要自动创建的模板
    'event'       => [
    ],
    // 需要自动创建的模板
    'service'       => [
    ],
    // 需要自动创建的模板
    'validate'       => [
    ],
];
