<?php

/**
 * +----------------------------------------------------------------------
 * | AdminInterface
 * +----------------------------------------------------------------------
 * | Copyright (c) 2017-2020 https://github.com/littlezo All rights reserved.
 * +----------------------------------------------------------------------
 * | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
 * +----------------------------------------------------------------------
 * | Author: @小小只 <soinco@qq.com>
 * +----------------------------------------------------------------------
 */

use app\AppService;

// 系统服务定义文件
// 服务在完成全局初始化之后执行
return [
    AppService::class,
];
